; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 2.0.0
; Author: DžejPý, last correction 1.10.2018
;
; Updating translations:
;   Before updating a translation, please make sure you have the current development version of
;   	Universal Extractor by enabling the 'Install beta updates' option in preferences and searching
;   	for updates by clicking 'Check for Updates' in the help menu.
; 	Make sure to read the messages titled 'Breaking changes' - which can be found at
;		https://github.com/Bioruebe/UniExtract2/issues/2 - for a list of changes to already translated
;   	terms. Please compare the affected translations with the always up-to-date English language file
;		and edit them to reflect the changes.
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file. Simply delete the Homepage line if you don't have one. Credit
;		yourself in the ABOUT_INFO_LABEL term if you want to.
;	Save the file in Unicode format (UTF-16/UCS-2 Little Endian) and send it to the developers -
;		via Github: https://github.com/Bioruebe/UniExtract2/issues/2 or
;		per e-mail to the address listed at https://bioruebe.com/contact/
;
;	The following symbols have special meanings:
;	& 		  - when used in a GUI label or button, it precedes the letter that will be registered
;				as a hotkey. Each letter should only be used once per menu.
;	%name	  - will be replaced with 'Universal Extractor'
;	%n	 	  - indicates a newline character
;	%t	  	  - indicates a tab character
;	%1,%2,... - indicates a string variable that UniExtract will replace
;		The content of each %1,... variable is hardcoded into UniExtract.
;		The numbered variables' order can be switched to fit your language's word order
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Konec"
YES_BUT = ""
NO_BUT = ""
DELETE_BUT = "Smazat"
COPY_BUT = ""
BATCH_BUT = "Dávka"
SEND_BUT = "Odeslat"
NEXT_BUT = "Další"
PREV_BUT = "Zpět"
CLOSE_BUT = ""
EXIT_BUT = ""
CONTINUE_BUT = ""
FINISH_BUT = "Hotovo"
ALWAYS_BUT = ""
NEVER_BUT = ""
CHECKBOX_REMEMBER = ""
CHECKBOX_DONT_ASK_AGAIN = ""
MAIN_DEST_DIR_LABEL = "Místo rozbalení:"
MAIN_FILE_LABEL = "Soubor k rozbalení:"
MAIN_DIRECTORY_LOCK = "použít opakovaně"
MAIN_DIRECTORY_LOCK_TOOLTIP = "Složka bude použita opakovaně, například při dávkovém rozbalení."
MENU_FILE_LABEL = "&Soubor"
MENU_FILE_OPEN_LABEL = "&Otevřít"
MENU_FILE_KEEP_OPEN_LABEL = "Neukončovat %name po rozbalení"
MENU_FILE_SHOW_LABEL = "Ukázat dávku"
MENU_FILE_CLEAR_LABEL = "Smazat dávku"
MENU_FILE_LOG_OPEN_LABEL = ""
MENU_FILE_LOG_FOLDER_OPEN_LABEL = "Otevřít složku s log soubory"
MENU_FILE_LOG_LABEL = "Smazat log soubor(y)(%1)"
MENU_FILE_QUIT_LABEL = "&Konec"
MENU_EDIT_LABEL = "&Upravit"
MENU_EDIT_SILENT_MODE_LABEL = "Tichý režim"
MENU_EDIT_PASSWORD_LABEL = "Seznam hesel"
MENU_EDIT_CONTEXT_LABEL = "Položky kontextového menu"
MENU_EDIT_PREFS_LABEL = "&Nastavení"
MENU_HELP_LABEL = "&Nápověda"
MENU_HELP_FEEDBACK_LABEL = ""
MENU_HELP_PLUGINS_LABEL = "Pluginy"
MENU_HELP_UPDATE_LABEL = "Zjistit novou verzi"
MENU_HELP_WEB_LABEL = "%1 &Domovská stránka"
MENU_HELP_GITHUB_LABEL = "%name na Github"
MENU_HELP_STATS_LABEL = "Statistiky"
MENU_HELP_PROGDIR_LABEL = "Otevřít složku s %name"
MENU_HELP_CONFIGFILE_LABEL = ""
MENU_HELP_ABOUT_LABEL = "O  programu"
PREFS_TITLE_LABEL = "Nastavení"
PREFS_UNIEXTRACT_OPTS_LABEL = "Možnosti Universal Extractor"
PREFS_HISTORY_LABEL = "Zapisovat historii &archivů"
PREFS_UPDATEINTERVAL_LABEL = "Hledat novinky po"
PREFS_UPDATE_DAILY = ""
PREFS_UPDATE_WEEKLY = ""
PREFS_UPDATE_MONTHLY = ""
PREFS_UPDATE_YEARLY = ""
PREFS_UPDATE_NEVER = ""
PREFS_UPDATE_CUSTOM = ""
PREFS_FORMAT_OPTS_LABEL = "Další možnosti"
PREFS_LANG_LABEL = "&Jazyk"
PREFS_WARN_EXECUTE_LABEL = "Upozornit před spuštěním souborů"
PREFS_WARN_EXECUTE_TOOLTIP = "Některé rozbalovací metody musí rozbalovaný soubor spustit.%nZapnutí této volby vás před spuštěním upozorní."
PREFS_CHECK_FREE_SPACE_LABEL = "Zjišťovat volné místo"
PREFS_CHECK_FREE_SPACE_TOOLTIP = "Zjišťovat volné místo před rozbalením."
PREFS_CHECK_UNICODE_LABEL = "Zjišťovat Unicode znaky"
PREFS_CHECK_UNICODE_TOOLTIP = "Zjišťovat Unicode znaky, které by mohly být problémem při rozbalení%n(například japonské znaky) - při zapnutí budou dočasně převedeny."
PREFS_APPEND_EXT_LABEL = "Opravit přípony souborů"
PREFS_APPEND_EXT_TOOLTIP = "Pokud je přípona nesprávná nebo zcela chybí,%nprovede se automatická oprava"
PREFS_HIDE_TRAY_LABEL = ""
PREFS_HIDE_STATUS_LABEL = "Nezobrazovat stavový box"
PREFS_HIDE_STATUS_FULLSCREEN_LABEL = "Skrýt stavový box ve fullscreen"
PREFS_HIDE_STATUS_FULLSCREEN_TOOLTIP = "Game mód - vypne zobrazování stavového boxu pokud je aktivní okno v režimu fullscreen."
PREFS_OPEN_FOLDER_LABEL = "Otevřít složku s rozbaleným obsahem"
PREFS_FEEDBACK_PROMPT_LABEL = "Dotaz na zpětnou vazbu"
PREFS_FEEDBACK_PROMPT_TOOLTIP = "Při chybě při rozbalování nabídne možnost odeslání zpětné vazby."
PREFS_WINDOW_POSITION_LABEL = "Ukládat pozici okna"
PREFS_SEND_STATS_LABEL = "Odesílat anonymní statistiky"
PREFS_SEND_STATS_TOOLTIP = "Automaticky odesílat statistiky (o typech archivů - např. zip - o množství rozbalení, použitém nastavení, vždy s náhodnou identifikací;%nne o rozbalovaných souborech nebo s informacemi, které by vedly k identifikaci)."
PREFS_LOG_LABEL = "Zapisovat log soubor"
PREFS_VIDEOTRACK_LABEL = "Podpora rozbalení videa"
PREFS_VIDEOTRACK_TOOLTIP = "Je-li vypnuté, %name nebude rozbalovat video stopy z video kontejnerů.%nHodí se, pokud z nich chcete rozbalit jen audio stopy či titulky."
PREFS_TOPMOST_LABEL = "Vždy nahoře"
PREFS_BETA_UPDATES_LABEL = ""
PREFS_SOURCE_FILES_LABEL = "Zdrojový soubor"
PREFS_SOURCE_FILES_OPT_ASK = "dotaz "
PREFS_SOURCE_FILES_OPT_DELETE = "smazat "
PREFS_SOURCE_FILES_OPT_KEEP = "zachovat "
PREFS_SOURCE_FILES_OPT_KEEP_TOOLTIP = "Zobrazit dotaz, zda zdrojový soubor%npo rozbalení smazat či zachovat."
PREFS_DELETE_ADDITIONAL_FILES_LABEL = ""
PREFS_DELETE_ADDITIONAL_FILES_TOOLTIP = ""
FEEDBACK_TITLE_LABEL = "Zpětná vazba"
FEEDBACK_SYSINFO_LABEL = ""
FEEDBACK_OUTPUT_LABEL = ""
FEEDBACK_MESSAGE_LABEL = ""
FEEDBACK_PRIVACY_ACCEPT_LABEL = ""
FEEDBACK_PRIVACY_VIEW_LABEL = ""
CONTEXT_ENTRIES_LABEL = "Kontextové menu"
CONTEXT_ENABLED_LABEL = "zapnuto"
CONTEXT_ALL_USERS_LABEL = "pro všechny uživatele"
CONTEXT_ADMIN_REQUIRED = "Vyžaduje práva správce"
CONTEXT_FILE_ASSOC_LABEL = "Zobrazovat jen pro soubory"
CONTEXT_SIMPLE_RADIO = "jednoduché"
CONTEXT_CASCADING_RADIO = "kaskádové"
CONTEXT_CASCADING_RADIO_TOOLTIP = "pro Win 7 a novější"
UPDATE_ACTION_INSTALL = ""
UPDATE_STATUS_SEARCHING = ""
UPDATE_TERM_PROGRAM_FILES = ""
UPDATE_WHATS_NEW = ""
FIRSTSTART_TITLE = ""
FIRSTSTART_PAGES = ""
FIRSTSTART_PAGE1 = ""
FIRSTSTART_PAGE2 = ""
FIRSTSTART_PAGE3 = ""
FFMPEG_LICENSE_ACCEPT_LABEL = ""
FFMPEG_LICENSE_VIEW_LABEL = ""
FFMPEG_SELECT_LABEL = ""
FFMPEG_SELECT_TITLE = ""
STATS_HEADER_STATUS = ""
STATS_HEADER_TYPE = ""
STATS_STATUS_SUCCESS = ""
STATS_STATUS_FAILED = ""
STATS_STATUS_FILEINFO = ""
STATS_STATUS_UNKNOWN = ""
STATS_NO_DATA = ""
FILESCAN_TITLE = ""
ABOUT_INFO_LABEL = "Původní verze od %1%nVerze 2.0.0 od Bioruebe <%2>%nVerze %3 od gvp9000%n%nVydáno pod %4"
ABOUT_VERSION = ""
METHOD_ADMIN_RADIO = "%1 Administrátorský instalátor"
METHOD_EXTRACTION_RADIO = "%1 rozbalení"
METHOD_HEADER = "%1 Rozbalení"
METHOD_RADIO_LABEL = "Metoda rozbalení"
METHOD_SWITCH_RADIO = "%1 přepínač"
METHOD_NOT_INSTALLER_RADIO = ""
METHOD_TEXT_LABEL = "%name podporuje následující metody na rozbalení %1 balíků.  Bohužel, ani jedna z těchto metod není stoprocentní.  Pokud vybraná metoda neuspěje, zkuste to znovu pomocí jiné metody."
METHOD_UNPACKER_RADIO = "%1 Rozbalovač"
METHOD_GAME_LABEL = ""
METHOD_GAME_NOGAME = ""
METHOD_NOT_IN_LIST = ""
METHOD_FILE_SELECT_LABEL = ""
METHOD_EXTRACTOR_SELECT_LABEL = ""

; GUI control functions
EXTRACT_TO = "Rozbalit do"
OPEN_FILE = "Otevřít soubor"
SELECT_FILE = "Vybrat soubor"
UPDATE_CURRENT = ""

; Common terms
TERM_ARCHIVE = "archiv"
TERM_AUDIO = ""
TERM_COMPILED = ""
TERM_COMPRESSED = "zkomprimovaný soubor"
TERM_CONTAINER = ""
TERM_DATABASE = ""
TERM_DISK_IMAGE = ""
TERM_DOWNLOAD = ""
TERM_DOWNLOADING = ""
TERM_EBOOK = "ebook"
TERM_ECARD = "ecard"
TERM_ENCODED = "dekódovaný soubor"
TERM_ENCRYPTED = ""
TERM_ERROR = ""
TERM_EXECUTABLE = ""
TERM_EXTRACT = "rozbalit "
TERM_FILE = ""
TERM_GAME = ""
TERM_HELP = "Soubor pomocníka"
TERM_HOTFIX = "záplata"
TERM_IMAGE = "obraz"
TERM_INSTALLED = ""
TERM_INSTALLER = "instalátor"
TERM_LOADING = ""
TERM_MERGE_MODULE = ""
TERM_OVERALL_PROGRESS = ""
TERM_PACKAGE = "balík"
TERM_PAGE = ""
TERM_PATCH = "záplata"
TERM_RECONSTRUCTED = ""
TERM_SCAN = "otestovat "
TERM_SCRIPT = ""
TERM_SFX = "Samorozbalovací"
TERM_STAGE = "Stupeň"
TERM_TESTING = "Testování"
TERM_TRANSLATION = ""
TERM_UNKNOWN = "neznámý"
TERM_UNPACKED = "rozbalený"
TERM_UPDATER = "aktualizační program"
TERM_VIDEO = ""

; Status messages
SCANNING_FILE = "Skenování souboru na zjištění typu souboru."
SCANNING_EXE = "Skenování souboru s %1 scan."
EXTRACTING = "Rozbalování souborů z: "
INIT_WAIT = "čekání na inicializaci instalátora.%nProsím čekejte."
SENDING_FEEDBACK = ""
INPUT_NEEDED = ""
SEARCHING_PASSWORD = ""
TESTING_PASSWORD = ""
MOVING_FILE = ""
RENAMING_FILES = ""
RENAMING_FILES_PROGRESS = ""
PROCESSING = ""
CLEANING_UP = ""

; Custom prompts
INIT_COMPLETE = "Inicializace %1.  Prosím ukončete instalátor, pak klikněte OK pro pokračování."
UNPACK_PROMPT = "Tento soubor je zbalený s %1 kompresí, ale může být rozbalený.%nJe to proto, že typ souboru je nepodporovaný, anebo%nneobsahuje žádné soubory na rozbalení.%n%nChcete přesto rozbalit tento soubor?%n%nPozor: Rozbalený soubor bude pojmenován:%n%2\%3_unpacked.%4"
UNPACK_FAILED = "Chyba: %1%nnemůže být rozbalený."
UNPACK_AGAIN = ""
NSIS_BINFILES = ""
WARN_EXECUTE = "Varování:  Na rozbalení souborů tohoto typu musí být tento soubor přímo spuštěný.%nPokud budete pokračovat, spustí se následující příkaz: %n%n%1%n%nPokud si myslíte, že tento soubor by mohl být zákeřný, doporučuje se nepokračovat.%nChcete pokračovat s rozbalováním?"
FEEDBACK_SUCCESS = ""
FEEDBACK_PROMPT = ""
FEEDBACK_PRIVACY = ""
FEEDBACK_OUTDATED = ""
FFMPEG_NEEDED = ""
PROGRAM_FILES_MISSING = ""
PLUGIN_MISSING = ""
UPDATE_PROMPT = ""
FILE_COPY = ""
FILE_DELETE = ""
BATCH_DUPLICATE = ""
NO_FREE_SPACE = "Varování:%nv cílovém místě není dostatek volného místa.%n%nVolné místo:%t%1 MB%nPotřebné místo:%t>%2 MB%nChybí:%t~%3 MB"
CONTEXT_DANGEROUS = "Varování:%nzměna asociace souborů může být nebezpečná. Např. nepůjde spustit soubor. Prosím zvažte, zda změnu opravdu chcete provést.%n%nChcete pokračovat?"
ELEVATION_REQUIRED = ""
ACCESS_DENIED = ""
MOVE_FAILED = ""

; Help text
HELP_TITLE = ""
HELP_USAGE_TITLE = ""
HELP_USAGE = ""
HELP_ARGUMENTS = "%n%nPodporované argumenty:"
HELP_SCAN = ""
HELP_FILENAME = "%n     soubor%tJméno souboru na rozbalení"
HELP_DESTINATION = "%n     umístění%tAdresář, do kterého rozbalit"
HELP_SILENT = "%n     %1%t%tTichý mód (neptá se)."
HELP_BATCH = "%n     %1%t%tPřidat soubor do dávky"
HELP_TYPE = ""
HELP_SUB = "%n%nPassing /sub instead of a destination directory name instructs%n%name to extract to subdirectory named after the archive."
HELP_LAST = ""
HELP_NOARGS = "%n%nSpuštění %name bez argumentů%nvyzve uživatele k zadání názvu souboru a cílového adresáře.
HELP_MORE = ""
HELP_EXAMPLE_TITLE = ""
HELP_EXAMPLE = ""
HELP_DOCS_LINK = ""

; Warning messages
WARN_CONVERSION_FAILED = ""
WARN_MOVE_FAILED = ""

; Error messages
UNKNOWN_FILETYPE_TITLE = ""
UNKNOWN_FILETYPE = ""
INVALID_FILE = ""
INVALID_DIR = "%1%nnelze vytvořit. Vyberte správné umístění."
NO_HISTORY = ""
EXTRACT_FAILED = "%name nemůže být rozbalený.%nVypadá to, že to je %1, který je podporován, ale rozbalení selhalo.%nPodívejte se do log souboru %2 pro více informací.%n%nKlikněte na ANO na prohlédnutí logového souboru, anebo Konec na ukončení."
NOT_PACKED = ""
DOWNLOAD_FAILED = ""
UPDATECHECK_FAILED = ""
UPDATE_FAILED = ""
UPDATE_NOADMIN = ""
FFMPEG_MOVE_FAILED = ""
FFMPEG_INVALID_FILE = ""
FEEDBACK_EMPTY = ""
FEEDBACK_ERROR = ""
FEEDBACK_PRIVACY_NOT_ACCETPED = ""
LICENSE_NOT_ACCEPTED = ""
BATCH_FINISH = ""
NOT_SUPPORTED_TITLE = ""
NOT_SUPPORTED = ""
MISSING_EXE = ""
EXTRACT_TIMEOUT = ""
WRONG_PASSWORD = ""
NO_FREE_SPACE_ERROR = ""
MISSING_PART = ""
PLUGIN_IMPORT_MISSINGFILES = ""
MISSING_DEFINITION = ""
OPEN_URL_FAILED = ""

; Plugin descriptions
PLUGIN_SUPPORTED_FILETYPES = ""
PLUGIN_ARC_CONV = ""
PLUGIN_ISCAB = ""
PLUGIN_THINSTALL = ""
PLUGIN_UNREAL = ""
PLUGIN_WINTERMUTE = ""
PLUGIN_CI = ""
PLUGIN_DGCA = ""
PLUGIN_BOOTIMG = ""
PLUGIN_IS5COMP = ""
PLUGIN_WOLF = ""
PLUGIN_EXTSIS = ""
PLUGIN_BITROCK = ""

; Context Menu integration
EXTRACT_FILES = "&Otevřít v UniExtractoru"
EXTRACT_HERE = "Rozbalit &zde"
EXTRACT_SUB = "Rozbalit do &podadresáře"
EXTRACT_LAST = "Rozbalit na předchozí místo"
SCAN_FILE = "Otestovat soubor"

; Other
DIR_ADDITIONAL_FILES = "Další soubory"

; Uninstaller
UNINSTALL = ""
UNINSTALL_TITLE = ""
UNINSTALL_LABEL = ""
UNINSTALL_REMOVE_LOGS = ""
UNINSTALL_REMOVE_USERDATA = ""
